# Concatenation

In [1]:
import numpy as np
import pandas as pd

In [2]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [3]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [4]:
one = pd.DataFrame(data_one)

In [8]:
two = pd.DataFrame(data_two)

In [6]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [9]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [10]:
pd.concat([one, two], axis = 1)

# along the columns
# they share the same index calls

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [12]:
pd.concat([one, two], axis = 0)

# concat on rows
# they share the different index calls

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [15]:
# a and b are the same to c and d indexes
# rename to place under each other

# make columns from two the same as one columns
two.columns = one.columns

In [16]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [18]:
mydf = pd.concat([one,two], axis=0)

In [19]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [21]:
# reset the index

mydf.index = range(len(mydf))

In [22]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

# Inner Merge ( pd.merge() )

returns a match in both tables

In [45]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [24]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [25]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [27]:
# as you see 2 people registed and came 
# those are the ones the inner join will return 
# on par with their log_id and reg_id
# name is supposed to be present in both columns


pd.merge(registrations, logins, how="inner", on = "name")

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

# Left / Right merge

* first table passed in is left 
* second table passed in is right

In [28]:
pd.merge(left=registrations,right=logins,how = "left", on="name")

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [ ]:
# the tables below are the same 
# you can always use left join 
# remember to switch columns

In [29]:
pd.merge(left=registrations,right=logins,how = "right", on="name")

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [30]:
pd.merge(left=logins ,right=registrations,how = "left", on="name")

   log_id     name  reg_id
0       1   Xavier     NaN
1       2   Andrew     1.0
2       3  Yolanda     NaN
3       4     Bobo     2.0

# Outer merge

include everything from both tables

In [31]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [32]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [35]:
pd.merge(registrations, logins, how="outer", on = "name")

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

# Megre on Index

In [46]:
registrations = registrations.set_index("name")
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [47]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [48]:
# to join these both together you have to 
# specify that you are joining on logins - name 
# and on registrations index columns

pd.merge(registrations, logins,left_index=True, right_on="name",how="inner")

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [50]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [51]:
# reset the index

registrations = registrations.reset_index()

In [52]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

# Different column names

In [56]:
# rename the columns differently

registrations.columns = ["reg_name", "reg_id"]
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [55]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [59]:
result = pd.merge(registrations, logins, how="inner", left_on="reg_name", right_on="name")
result

# will return both
# need to drop one colum

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [60]:
result.drop("reg_name",1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

# Tag Duplicate columns

In [61]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [62]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [64]:
registrations.columns = ["name", 'id']
logins.columns = ["id", "name"]

In [65]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [66]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [68]:
# if we merge the columns with identical columns names = "id"
# pandas will name them accordingly
# x -left
# y - right


pd.merge(registrations, logins, how="inner", on="name")

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [69]:
# may provide own suffixes in tuple


pd.merge(registrations, logins, how="inner", on="name", suffixes=("reg_id", "log_id"))

     name  idreg_id  idlog_id
0  Andrew         1         2
1    Bobo         2         4